app/controllers/cupboard_controller.rb

  def index

    @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item], true ])
---
SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)

  def add_clothes

    @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item], true ])
---
SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)

  def save_clothes

    @fabric = Fabric.new

    @fabric.name       = params['cloth_name']
    @fabric.size       = params['cloth_size']
    @fabric.user_id    = session[:user_item].id

    @fabric.save
---
SELECT * FROM `fabrics` WHERE (user_id = 2)
INSERT INTO `fabrics` (`name`, `size`, `user_id`, `weargear`, `bugwear`) VALUES('Lappi 2012', 'M', 2, 1, 0)

  def look_for_clothes

     @clothes_all = Fabric.find(:all, :conditions => ["user_id = ?", session[:user_item].id])
---
SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)

  def update_clothes


    if params['send'] == "Poista vaate"

      Fabric.delete(params[:cloth_id])

      else


      @cloth = Fabric.find_by_id(params[:cloth_id])
---
SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)

  def modify

    @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
---
SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)

  def view

    @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
---
SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)