app/controllers/holiday_controller.rb

SELECT * FROM `fabrics` WHERE (user_id = 1 and weargear = 1)
---
  def index


    @clothes_all     = Fabric.find(:all, :conditions => ["user_id = ?", session[:user_item].id])

SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)
---
 def make_holidaycup


    @clothes_all     = Fabric.find(:all, :conditions => ["user_id = ?", session[:user_item]])

SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)
---
  def holidaycup

    @clothes_all   = Fabric.find(:all, :conditions => ["user_id = ?", session[:user_item].id])

SELECT * FROM `fabrics` WHERE (user_id = 2 and id='1') LIMIT 1
INSERT INTO `note_items` (`note_id`, `fabric_id`) VALUES(1, 1)
INSERT INTO `notes` (`name`, `user_id`) VALUES('Irlanti 2013', 2)
---
  def save_holidaycup

    @clothes_all   = Fabric.find(:all, :conditions => ["user_id = ?", session[:user_item]])
    @clothes       = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item], true ])
    @flea_gear     = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item], true ])

    @note          = Note.new
    @note.name     = session[:note_name]
    @note.user_id  = session[:user_item].id
    @note.save

SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)
SELECT * FROM `note_items` WHERE (`note_items`.note_id = 1)
SELECT * FROM `notes` WHERE (user_id = 2)
---
  def view_holidaycup

    @clothes_all   = Fabric.find(:all, :conditions => ["user_id = ?", session[:user_item].id])
    @clothes       = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
    @flea_gear     = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item].id, true ])

    @notes = Note.find(:all,  :conditions => ["user_id = ?", session[:user_item].id])

SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)
SELECT * FROM `note_items` WHERE (note_id = '1')
SELECT * FROM `notes` WHERE (id = '1')
---
  def look_holidaycup

    @clothes_all   = Fabric.find(:all, :conditions => ["user_id = ?", session[:user_item].id])
    @clothes       = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
    @flea_gear     = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item].id, true ])

    @notes = Note.find(:all,  :conditions => ["id = ?", params[:id]])