app/controllers/homepage_controller.rb

  def index

  @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
---
SELECT * FROM `fabrics` WHERE (user_id = 1 and weargear = 1)

  def send_message

  @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
  @flea_gear = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item].id, true ])



  @users = User.find(:all, :conditions => ["id != ? ", session[:user_item].id])
---
SELECT * FROM `fabrics` WHERE (user_id = 1 and weargear = 1)
SELECT * FROM `users` WHERE (id != 1 )

  def messages

  @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
  @flea_gear = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item].id, true ])


  @messages = Message.find(:all, :conditions => ["receiver_id = ?", session[:user_item].id])
---
SELECT * FROM `fabrics` WHERE (user_id = 1 and weargear = 1)
SELECT * FROM `messages` WHERE (receiver_id = 1)

 def save_message

  @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
  @flea_gear = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item].id, true ])



  @msg = Message.new
  @msg.message_text = params['message']
  @msg.sender_id = session[:user_item].id
  @msg.receiver_id = params['receiver']
  @msg.save



  redirect_to(:controller => 'homepage', :action => 'messages')

  @messages = Message.find(:all, :conditions => ["receiver_id = ?", session[:user_item].id])
---
SELECT * FROM `fabrics` WHERE (user_id = 1 and weargear = 1)
INSERT INTO `messages` (`timestamp`, `receiver_id`, `message_text`, `sender_id`) VALUES(NULL, 2, 'Hello World!				 \r\n				 \r\n				 ', 1)
SELECT * FROM `messages` WHERE (receiver_id = 1)