app/controllers/login_controller.rb

INSERT INTO `users` (`updated_at`, `username`, `logged`, `sex`, `signed`, `visits`, `password`, `email`) VALUES('2013-04-19 09:03:01', 'anssi', NULL, 'male', NULL, 0, '1c26febccf0cd61e261241895031f29c3fcad03f', 'anssi@gmail.com')
---
  def signup
    case request.method
      when :post
        user = User.new(params['user'])
        user.visits = 0;
        #@user.profile = Profile.new
        #@user.profile.photo = Photo.new

        if user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def logout

     if session[:user_item]
       @user = User.find(session[:user_item].id)