app/controllers/mainpage_controller.rb

  def index

  @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item], true ])
---
SELECT * FROM `fabrics` WHERE (user_id = 4 and weargear = 1)