app/controllers/webshop_controller.rb

SELECT * FROM `fabrics` WHERE (`fabrics`.`id` IS NULL) LIMIT 1
---
  def index

   @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])

SELECT * FROM `fabrics` WHERE (user_id = 2 and weargear = 1)
SELECT * FROM `stock_items` WHERE (fabrics_id = 1)
---
  def check_fleawear

   @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
   @flea_gear = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item].id, true ])

   @cloth_item = Fabric.find_by_id(params[:id])

   @stock_biddings = StockItem.find(:all, :conditions => ["fabrics_id = ?", @cloth_item.id])

SELECT * FROM `fabrics` WHERE (user_id = 1 and weargear = 1)
SELECT * FROM `stock_items` WHERE (fabrics_id = 1) ORDER BY cash desc LIMIT 1
---
  def bid_fleawear

  require 'bigdecimal'
  require 'bigdecimal/util'


   @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
   @flea_gear = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item].id, true ])

   @cloth_item = Fabric.find_by_id(params[:id])


   @stock_biddings = StockItem.find(:all, :conditions => ["fabrics_id = ?", @cloth_item.id])

SELECT * FROM `fabrics` WHERE (user_id = 1 and weargear = 1)
SELECT * FROM `stock_items` WHERE (fabrics_id = 1) ORDER BY cash desc LIMIT 1
INSERT INTO `stock_items` (`timestamp`, `fabrics_id`, `cash`, `bidder_id`) VALUES(NULL, 1, 1.0, 1)
---
   def save_fleawear_bid

     @clothes = Fabric.find(:all, :conditions => ["user_id = ? and weargear = ?", session[:user_item].id, true ])
     @flea_gear = Fabric.find(:all, :conditions => ["user_id = ? and bugwear = ?", session[:user_item].id, true ])

     @cloth_item = Fabric.find_by_id(params['cloth_id'])


     @sale_shirts = Fabric.find(:all, :conditions => ["bugwear = ?", true])



     @stock_bidding     = StockItem.find(:first, :conditions => ["fabrics_id = ?", @cloth_item.id], :order => ["cash desc"])



     @stock_item = StockItem.new
     @stock_item.bidder_id = session[:user_item].id
     @stock_item.fabrics_id = params['cloth_id']
     @stock_item.cash = params['bid_amount']


     if @stock_bidding.nil?

       @msg = "Ostotarjous tallennettu"
       @stock_item.save